#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.archive_file.process_expired_keys_archive: Refreshing state...
data.archive_file.notify_service_user_owner_archive: Refreshing state...
data.archive_file.get_expired_keys_archive: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.KeysRotationDaily will be created
  + resource "aws_cloudwatch_event_rule" "KeysRotationDaily" {
      + arn                 = (known after apply)
      + description         = "Execute KeysRotationD step function daily"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "KeysRotationDaily"
      + schedule_expression = "rate(1 day)"
    }

  # aws_cloudwatch_event_target.KeysRotationDailyTarget will be created
  + resource "aws_cloudwatch_event_target" "KeysRotationDailyTarget" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + role_arn  = (known after apply)
      + rule      = "KeysRotationDaily"
      + target_id = (known after apply)
    }

  # aws_cloudwatch_log_group.get_expired_users_log_group will be created
  + resource "aws_cloudwatch_log_group" "get_expired_users_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/GetExpiredKeys"
      + retention_in_days = 1
    }

  # aws_cloudwatch_log_group.notify_service_user_owner_log_group will be created
  + resource "aws_cloudwatch_log_group" "notify_service_user_owner_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/NotifyServiceOwners"
      + retention_in_days = 1
    }

  # aws_cloudwatch_log_group.process_expired_keys_log_group will be created
  + resource "aws_cloudwatch_log_group" "process_expired_keys_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/PoceedExpiredKeys"
      + retention_in_days = 1
    }

  # aws_iam_policy.cwe_policy will be created
  + resource "aws_iam_policy" "cwe_policy" {
      + arn         = (known after apply)
      + description = "Iam policy for lambda PoceedExpiredKeys"
      + id          = (known after apply)
      + name        = "CWE-KeysRotationPolicy"
      + path        = "/"
      + policy      = (known after apply)
    }

  # aws_iam_policy.get_expired_users_policy will be created
  + resource "aws_iam_policy" "get_expired_users_policy" {
      + arn         = (known after apply)
      + description = "Iam policy for lambda GetExpiredKeys"
      + id          = (known after apply)
      + name        = "GetExpiredKeys"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "iam:ListUsers",
                          + "iam:GetUser",
                          + "iam:ListAccessKeys",
                          + "iam:ListUserTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.notify_service_user_owner_policy will be created
  + resource "aws_iam_policy" "notify_service_user_owner_policy" {
      + arn         = (known after apply)
      + description = "Iam policy for lambda NotifyServiceOwners"
      + id          = (known after apply)
      + name        = "NotifyServiceOwners"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "VisualEditor0"
                    },
                  + {
                      + Action   = "ssm:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "VisualEditor1"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "VisualEditor2"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.process_expired_keys_policy will be created
  + resource "aws_iam_policy" "process_expired_keys_policy" {
      + arn         = (known after apply)
      + description = "Iam policy for lambda PoceedExpiredKeys"
      + id          = (known after apply)
      + name        = "PoceedExpiredKeys"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "iam:UpdateAccessKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.step_function_policy will be created
  + resource "aws_iam_policy" "step_function_policy" {
      + arn         = (known after apply)
      + description = "IAM policy for step function"
      + id          = (known after apply)
      + name        = "step_function_policy"
      + path        = "/"
      + policy      = (known after apply)
    }

  # aws_iam_role.cwe_role will be created
  + resource "aws_iam_role" "cwe_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Sid       = "131232"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CWE-KeysRotation"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.get_expired_users_role will be created
  + resource "aws_iam_role" "get_expired_users_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "131232"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Lambda-GetExpiredKeys"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.iam_for_sfn will be created
  + resource "aws_iam_role" "iam_for_sfn" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_sfn"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.notify_service_user_owner_role will be created
  + resource "aws_iam_role" "notify_service_user_owner_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "131232"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Lambda-NotifyServiceOwners"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.process_expired_keys_role will be created
  + resource "aws_iam_role" "process_expired_keys_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "131232"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Lambda-PoceedExpiredKeys"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.get_expired_users_attach will be created
  + resource "aws_iam_role_policy_attachment" "get_expired_users_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Lambda-GetExpiredKeys"
    }

  # aws_iam_role_policy_attachment.notify_service_user_owner_attach will be created
  + resource "aws_iam_role_policy_attachment" "notify_service_user_owner_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Lambda-NotifyServiceOwners"
    }

  # aws_iam_role_policy_attachment.process_expired_keys_attach will be created
  + resource "aws_iam_role_policy_attachment" "process_expired_keys_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Lambda-PoceedExpiredKeys"
    }

  # aws_iam_role_policy_attachment.step_function_attachment will be created
  + resource "aws_iam_role_policy_attachment" "step_function_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_sfn"
    }

  # aws_lambda_function.get_expired_users_lambda will be created
  + resource "aws_lambda_function" "get_expired_users_lambda" {
      + arn                            = (known after apply)
      + filename                       = "../lambda/get_expired_users.zip"
      + function_name                  = "GetExpiredKeys"
      + handler                        = "get_expired_users.get_expired_keys"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "pVSut6Qd88NI4To1zURRzhW3p8RLd3smmGjgg3WInqo="
      + source_code_size               = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.notify_service_user_owner_lambda will be created
  + resource "aws_lambda_function" "notify_service_user_owner_lambda" {
      + arn                            = (known after apply)
      + filename                       = "../lambda/notify_service_user_owner.zip"
      + function_name                  = "NotifyServiceOwners"
      + handler                        = "notify_service_user_owner.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "aAIFC/juyZni223EHufKjOlzf7xSWu5lrB9cPRYXJN8="
      + source_code_size               = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.process_expired_keys_lambda will be created
  + resource "aws_lambda_function" "process_expired_keys_lambda" {
      + arn                            = (known after apply)
      + filename                       = "../lambda/process_expired_keys.zip"
      + function_name                  = "PoceedExpiredKeys"
      + handler                        = "process_expired_keys.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "I4ehrzvjbRAHtEc7OFam3/4enjhkGC/I0fpGknRerHY="
      + source_code_size               = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_sfn_state_machine.state_machine will be created
  + resource "aws_sfn_state_machine" "state_machine" {
      + creation_date = (known after apply)
      + definition    = (known after apply)
      + id            = (known after apply)
      + name          = "KeysRotation"
      + role_arn      = (known after apply)
      + status        = (known after apply)
    }

  # aws_sns_topic.admin_sns_topic will be created
  + resource "aws_sns_topic" "admin_sns_topic" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "admin_notification"
      + policy = (known after apply)
    }

Plan: 24 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @mpostument, Action: `pull_request`, Working Directory: ``, Workflow: `PR Builder`*